Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The constants TRUE and FALSE The constants TRUE and FALSE (case-insensitive) are the two possible boolean values.
es: Fíjate en que los valores negativos son distinto de cero y considerados CIERTO (TRUE)!

source: When necessary, an expression is automatically converted to boolean.
es: La cadena vacía y la cadena "0" son FALSO (FALSE); todas las demás cadenas son TRUE.

source: See the section about type-casting for details about how.
es: Con los tipos no escalares (arrays y objetos) - si el valor no contiene elementos se considera FALSO (FALSE), en caso contrario se considera CIERTO (TRUE).

source: PHP provides a full and powerful implementation of expressions, and documenting it entirely goes beyond the scope of this manual.
es: PHP te brinda una completa y potente implementación de expresiones, y documentarla enteramente está más allá del objetivo de ete manual.

source: The above examples should give you a good idea about what expressions are and how you can construct useful expressions.
es: Los ejemplos anteriores, deberían darte una buena idea de qué son las expresiones y cómo construir expresiones útiles.

source: Throughout the rest of this manual we 'll write expr to indicate any valid PHP expression.
es: A lo largo del resto del manual, escribiremos expr para indicar una expresión PHP válida.

source: Operators
es: Operadores

source: A class is a collection of variables and functions working with these variables.
es: Una clase es una colección de variables y de funciones que acceden a esas variables.

source: A class is defined using the following syntax:
es: Una clase se define con la siguiente sintaxis:

source: ?php class Cart {var $items; / / Items in our shopping cart / / Add $num articles of $artnr to the cart function add_item ($artnr, $num) {$this - items[$artnr] += $num;} / / Take $num articles of $artnr out of the cart function remove_item ($artnr, $num) {if ($this - items[$artnr] $num) {$this - items[$artnr] -= $num; return true;} else {return false;}}}?
es: ?php class Cart {var $items; / / Items en nuestro carro de la compra / / Añadir $num artículos de tipo $artnr al carro function add_item ($artnr, $num) {$this - items[$artnr] += $num;} / / Sacar $num artículos del tipo $artnr del carro function remove_item ($artnr, $num) {if ($this - items[$artnr] $num) {$this - items[$artnr] -= $num; return true;} else {return false;}}}?

source: The name stdClass is used interally by Zend and is reserved.
es: Las clases son tipos, es decir, son plantillas para variables.

source: The function names __sleep and __wakeup The function names __sleep and __wakeup are magical in PHP classes.
es: Tienes que crear una variable del tipo deseado con el operador new.

source: You cannot have functions with these names in any of your classes unless you want the magic functionality associated with them.
es: $cart = new Cart; $cart - add_item("10", 1);

source: PHP reserves all function names starting with __ as magical.
es: Este ejemplo crea un objeto $cart de clase Cart.

source: In PHP 4, only constant initializers for var variables are allowed.
es: Las Clases pueden ser extensiones de otras clases.

source: Such a function is called a constructor (see below).
es: Las clases extendidas o derivadas tienen todas las variables y funciones de la clase base y lo que les añadas al extender la definición.

source: Classes are types, that is, they are blueprints for actual variables.
es: La herencia múltiple no está soportada.

source: ?php $cart = new Cart; $cart - add_item("10", 1); $another_cart = new Cart; $another_cart - add_item("0815", 3);
es: class Named_Cart extends Cart {var $owner; function set_owner ($name) {$this - owner = $name;}}

source: The function add_item() of the $cart object is being called to add 1 item of article number 10 to the $cart.
es: Ese ejemplo define una clase Named_Cart (carro con nombre o dueño) que tiene todas las variables y funciones de Cart, y además añade la variable $owner y una función adicional set_owner().

source: Both, $cart and $another_cart, have functions add_item(), remove_item() and a variable items.
es: Un carro con nombre se crea de la forma habitual y, una vez hecho, puedes acceder al propietario del carro.

source: You can think of the objects as something similar to directories in a filesystem.
es: En los carros con nombre también puedes acceder a las funciones normales del carro:

source: Just like with directories where you 'll have to type the full pathname in order to reach each file from the toplevel directory, you have to specify the complete name of the function you want to call:
es: $ncart = new Named_Cart; / / Creamos un carro con nombre $ncart - set_owner ("kris"); / / Nombramos el carro print $ncart - owner; / / Imprimimos el nombre del propietario $ncart - add_item ("10", 1); / / Funcionalidad heredada de Cart

source: In PHP terms, the toplevel directory would be the global namespace, and the pathname separator would be -.
es: Entre funciones de una clase, la variable $this hace referencia al propio objeto.

source: Thus, the names $cart - items and $another_cart - items name two different variables.
es: Tienes que usar $this - loquesea para acceder a una variable o función llamada loquesea del objeto actual.

source: Note that the variable is named $cart - items, not $cart - $items, that is, a variable name in PHP has only a single dollar sign.
es: Los constructores son funciones de una clase que se llaman automáticamente al crear una nueva instancia (objeto) de una clase.

source: / / correct, single $$cart - items = array( "10 "= 1); / / invalid, because $cart - $items becomes $cart -" "$cart - $items = array("10" = 1); / / correct, but may or may not be what was intended: / / $cart - $myvar becomes $cart - items $myvar = 'items'; $cart - $myvar = array("10 "= 1);
es: class Auto_Cart extends Cart {function Auto_Cart () {$this - add_item ("10", 1);}}

source: Within a class definition, you do not know under which name the object will be accessible in your program: at the time the Cart class was written, it was unknown that the object will be named $cart or $another_cart later.
es: Este ejemplo define una clase Auto_Cart que es un Cart junto con un constructor que inicializa el carro con un item del tipo de artículo "10" cada vez que se crea un nuevo Auto_Cart con "new ".

source: Thus, you cannot write $cart - items within the Cart class itself.
es: Los constructores también pueden recibir parámetros y estos parámetros pueden ser opcionales, lo que los hace más útiles.

source: Thus, '$this - items[$artnr] += $num' can be read as'add $num to the $artnr counter of my own items array 'or'add $num to the $artnr counter of the items array within the current object'.
es: class Constructor_Cart extends Cart {function Constructor_Cart ($item = "10", $num = 1) {$this - add_item ($item, $num);}} / / Compramos las mismas cosas aburridas de siempre $default_cart = new Constructor_Cart; / / Compramos las cosas interesantes $different_cart = new Constructor_Cart ("20", 17);

source: You might want to take a look at the Class / Object Functions
es: Para las clases derivadas, el constructor de la clase padre no es llamado automáticamente cuando se llama al constructor de la clase derivada.

source: extends
es: References Explained

source: Chapter 11.
es: Capítulo 11.

source: The basic assignment operator is "=".
es: El operador básico de asignación es "=".

source: Your first inclination might be to think of this as "equal to".
es: A primera vista podrías pensar que es el operador de comparación "igual que".

source: Don 't.
es: Pero no.

source: It really means that the the left operand gets set to the value of the expression on the rights (that is, "gets set to").
es: Realmente significa que el operando de la izquierda toma el valor de la expresión a la derecha, (esto es, "toma el valor de").

source: The value of an assignment expression is the value assigned.
es: El valor de una expresión de asignación es el propio valor asignado.

source: That is, the value of "$a = 3" is 3.
es: Esto es, el valor de "$a = 3" es 3.

source: This allows you to do some tricky things:
es: Esto permite hacer cosas curiosas como

source: $a = ($b = 4) + 5; / / $a is equal to 9 now, and $b has been set to 4.
es: $a = ($b = 4) + 5; / / ahora $a es igual a 9, y $b vale 4.

source: In addition to the basic assignment operator, there are "combined operators" for all of the binary arithmetic and string operators that allow you to use a value in an expression and then set its value to the result of that expression.
es: Este operador combinado te permite, de una sola vez, usar una variable en una expresión y luego establecer el valor de esa variable al resultado de la expresión.

source: $a = 3; $a += 5; / / sets $a to 8, as if we had said: $a = $a + 5; $b = "Hello "; $b .= "There !"; / / sets $b to "Hello There !", just like $b = $b. "There !";
es: $a = 3; $a += 5; / / establece $a a 8, como si hubiésemos escrito: $a = $a + 5; $b = "Hola "; $b .= "Ahí !"; / / establece $b a "Hola Ahí !", igual que si hiciésemos $b = $b. "Ahí !";

source: Note that the assignment copies the original variable to the new one (assignment by value), so changes to one will not affect the other.
es: Fíjate en que la asignación realiza una nueva copia de la variable original (asignación por valor), por lo que cambios a la variable original no afectan a la copia.

source: This may also have relevance if you need to copy something like a large array inside a tight loop.
es: Esto puede tener interés si necesitas copiar algo como un array con muchos elementos dentro de un bucle que se repita muchas veces (cada vez se realizará una nueva copia del array).

source: To learn more about references, please read References explained.
es: PHP4 soporta asignación por referencia, usando la sintaxis $var = $othervar;, pero esto no es posible en PHP3. 'Asignación por referencia 'quiere decir que ambas variables acabarán apuntando al mismo dato y que nada es realmente copiado.

source: Arithmetic Operators
es: Operadores

source: Bitwise Operators
es: Operadores Bit a bit

source: If both the left - and right-hand parameters are strings, the bitwise operator will operate on the characters in this string.
es: Los operadores bit a bit te permiten activar o desactivar bits individuales de un entero.

source: Table 11-3.
es: Tabla 11-2.

source: Example
es: ejemplo

source: Result
es: resultado

source: And
es: Y

source: Bits that are set in both $a and $b are set.
es: Se activan los bits que están activos tanto en $a como $b.

source: Or
es: O

source: Bits that are set in either $a or $b are set.
es: Se activan los bits que están activos en $a o que lo están en $b.

source: Xor
es: Xor ("o exclusiva")

source: Bits that are set in $a or $b but not both are set.
es: Se activan los bits que están activos en $a o en $b pero no en ambos a la vez.

source: Not
es: No

source: Bits that are set in $a are not set, and vice versa.
es: Se activan los bits que no están activos en $a.

source: Shift left
es: Desplazamiento a la izquierda

source: Shift the bits of $a $b steps to the left (each step means "multiply by two")
es: Desplaza los bits de $a, $b posiciones hacia la izquierda (por aritmética binaria, cada posición desplazada equivale a multiplicar por dos el valor de $a)

source: Shift right
es: Desplazamiento a la derecha

source: Shift the bits of $a $b steps to the right (each step means "divide by two")
es: Desplaza los bits de $a, $b posiciones hacia la derecha (por aritmética binaria, cada posición desplazada equivale a dividir entre dos el valor de $a)

source: Assignment Operators
es: Operadores de Asignación

source: Comparison Operators
es: Operadores de Comparación

source: Comparison operators, as their name implies, allow you to compare two values.
es: Los operadores de comparación, como su nombre indica, permiten comparar dos valores.

source: Table 11-4.
es: Tabla 11-3.

source: Equal
es: Igualdad

source: TRUE if $a is equal to $b.
es: Cierto si $a es igual a $b.

source: Identical
es: Identidad

source: $a != $b
es: Cierto si $a es igual a $b y si son del mismo tipo (sólo PHP4)

source: $a $b
es: Desigualdad

source: TRUE if $a is not equal to $b.
es: Cierto si $a no es igual a $b.

source: Not identical
es: Menor que

source: TRUE if $a is not equal to $b, or they are not of the same type. (PHP 4 only)
es: Cierto si $a es estrictamente menor que $b.

source: Less than
es: Mayor que

source: TRUE if $a is strictly less than $b.
es: Cierto si $a es estrictamente mayor que $b.

source: Greater than
es: Menor o igual que

source: $a = $b
es: Cierto si $a es menor o igual que $b.

source: TRUE if $a is less than or equal to $b.
es: Mayor o igual que

source: Greater than or equal to
es: Cierto si $a es mayor o igual que $b.

source: Another conditional operator is the "?:" (or ternary) operator, which operates as in C and many other languages.
es: Otro operador condicional es el operador "?:" (o ternario), que funciona como en C y otros muchos lenguajes.

source: Error Control Operators
es: Operador de ejecución

source: Note that these are not single-quotes!
es: PHP soporta un operador de ejecución: el apóstrofe invertido (``). ¡Fíjate que no son apostrofes normales!

source: $output = `ls -al`; echo "pre $output / pre";
es: PHP intentará ejecutar la instrucción contenida dentro de los apóstrofes invertidos como si fuera un comando del shell; y su salida devuelta como el valor de esta expresión (i.e., no tiene por qué ser simplemente volcada como salida; puede asignarse a una variable).

source: See also escapeshellcmd(), exec(), passthru(), popen(), shell_exec(), and system().
es: Ver también system(), passthru(), exec(), popen(), y escapeshellcmd().

source: Incrementing / Decrementing Operators
es: Operadores de Incremento / decremento

source: For example, in the expression 1 + 5 * 3, the answer is 16 and not 18 because the multiplication ("*") operator has a higher precedence than the addition ("+") operator.
es: ¿Recuerdas la aritmética básica del colegio?

source: For instance: (1 + 5) * 3 evaluates to 18.
es: Pues estos operadores funcionan exactamente igual.

source: Table 11-1.
es: Tabla 11-1.

source: Associativity
es: Operadores Aritméticos

source: left
es: ejemplo

source: or
es: nombre

source: xor
es: resultado

source: and
es: $a + $b

source: print
es: Adición

source: = += -= *= / = .= %= = _BAR_ = ^= ~= = =
es: Suma de $a y $b.

source: _BAR_ _BAR_
es: Substracción

source: non-associative
es: Multiplicación

source: ! ~ + + - - (int) (float) (string) (array) (object) @
es: Cociente de $a entre $b.

source: new
es: Módulo

source: Although! has a higher precedence than =, PHP will still allow expressions similar to the following: if (!$a = foo()), in which case the output from foo() is put into $a.
es: Resto de $a dividido entre $b.

source: PHP supports C-style pre - and post-increment and decrement operators.
es: PHP soporta los operadores de predecremento y post incremento al estilo de C.

source: Table 11-5.
es: Tabla 11-4.

source: Increment / decrement Operators
es: Operadores de Incremento / decremento

source: Effect
es: efecto

source: Pre-increment
es: Preincremento

source: Increments $a by one, then returns $a.
es: Incrementa $a en uno y después devuelve $a.

source: Post-increment
es: Postincremento

source: Returns $a, then increments $a by one.
es: Devuelve $a y después incrementa $a en uno.

source: Pre-decrement
es: Predecremento

source: Decrements $a by one, then returns $a.
es: Decrementa $a en uno y después devuelve $a.

source: Post-decrement
es: Postdecremento

source: Returns $a, then decrements $a by one.
es: Devuelve $a y después decrementa $a en uno.

source: Here 's a simple example script:
es: He aquí un listado de ejemplo:

source: ?php echo "h3 Postincrement / h3"; $a = 5; echo "Should be 5: ". $a+ +." br / \n"; echo "Should be 6: ". $a." br / \n"; echo "h3 Preincrement / h3"; $a = 5; echo "Should be 6: ". ++$a." br / \n"; echo "Should be 6: ". $a." br / \n"; echo "h3 Postdecrement / h3"; $a = 5; echo "Should be 5: ". $a- -." br / \n"; echo "Should be 4: ". $a." br / \n"; echo "h3 Predecrement / h3"; $a = 5; echo "Should be 4: ". --$a." br / \n"; echo "Should be 4: ". $a." br / \n";?
es: ?php echo "h3 Postincremento / h3"; $a = 5; echo "Debería ser 5: ". $a+ +." br \n"; echo "Debería ser 6: ". $a." br \n"; echo "h3 Preincremento / h3"; $a = 5; echo "Debería ser 6: ". ++$a." br \n"; echo "Debería ser 6: ". $a." br \n"; echo "h3 Postdecremento / h3"; $a = 5; echo "Debería ser 5: ". $a- -." br \n"; echo "Debería ser 4: ". $a." br \n"; echo "h3 Predecremento / h3"; $a = 5; echo "Debería ser 4: ". --$a." br \n"; echo "Debería ser 4: ". $a." br \n";?

source: Execution Operators
es: Operador de ejecución

source: Logical Operators
es: Operadores Lógicos

source: Table 11-6.
es: Tabla 11-5.

source: TRUE if both $a and $b are TRUE.
es: Cierto si tanto $a como $b son ciertos.

source: TRUE if either $a or $b is TRUE.
es: Cierto si $a o $b son ciertos.

source: TRUE if either $a or $b is TRUE, but not both.
es: Cierto si $a es cierto o $b es cierto, pero no ambos a la vez.

source: TRUE if $a is not TRUE.
es: Cierto si $a no es cierto.

source: The reason for the two different variations of "and" and "or "operators is that they operate at different precedences. (See Operator Precedence.)
es: La razón de las dos variaciones de "y" y "o "es que operan con distinta precedencia (ver Precedencia de Operadores.)

source: String Operators
es: Precedencia de Operadores

source: There are two string operators.
es: Hay dos operadores de cadenas.

source: The first is the concatenation operator ('.'), which returns the concatenation of its right and left arguments.
es: El primero es el operador de concatenación ('.'), que devuelve el resultado de concatenar sus operandos izquierdo y derecho.

source: The second is the concatenating assignment operator ('.='), which appends the argument on the right side to the argument on the left side.
es: El segundo es el operador de concatenación y asignación ('.=').

source: Please read Assignment Operators for more information.
es: Consulta Operadores de Asignación para más información.

source: $a = "Hello"; $b = $a. "World !"; / / now $b contains "Hello World! "$a = "Hello"; $a .= "World !"; / / now $a contains "Hello World! "
es: $a = "Hola"; $b = $a. "Mundo !"; / / ahora $b contiene "Hola Mundo! "$a = "Hola"; $a .= "Mundo !"; / / ahora $a contiene "Hola Mundo! "

source: Chapter 15.
es: Capítulo 15.

source: References inside the constructor
es: Clases y Objetos

source: Features
es: Características

source: Chapter 7.
es: Capítulo 7.

source: Because you can have another PHP-array as a value, you can also quite easily simulate trees.
es: Los arrays actualmente actúan tanto como tablas hash (arrays asociativos) como arrays indexados (vectores).

source: For more information we refer you to external literature about this broad topic.
es: PHP soporta tanto arrays escalares como asociativos.

source: It takes a certain number of comma-separated key = value pairs.
es: De hecho, no hay diferencias entre los dos.

source: ?php $arr = array( "foo "= "bar", 12 = true); echo $arr["foo"]; / / bar echo $arr[12]; / / 1?
es: Se puede crear una array usando las funciones list() o array(), o se puede asignar el valor de cada elemento del array de manera explícita.

source: If a key is the standard representation of an integer, it will be interpreted as such (i.e. "8 "will be interpreted as 8, while "08" will be interpreted as "08 ").
es: $a[ 0] = "abc"; $a[1] = "def"; $b["foo"] = 13;

source: A value can be of any PHP type.
es: También se puede crear un array simplemente añadiendo valores al array.

source: If you omit a key, the maximum of the integer-indices is taken, and the new key will be that maximum + 1.
es: Cuando se asigna un valor a una variable array usando corchetes vacíos, el valor se añadirá al final del array.

source: Having e.g. the highest index being -6 will result in -5 being the new key.
es: $a[] = "hola"; / / $a[2] == "hola "$a[] = "mundo"; / / $a[3] == "mundo"

source: ?php / / This array is the same as... array( 5 = 43, 32, 56, "b "= 12); / / ...this array array(5 = 43, 6 = 32, 7 = 56, "b" = 12);?
es: Los arrays se pueden ordenar usando las funciones asort(), arsort(), ksort(), rsort(), sort(), uasort(), usort(), y uksort() dependiendo del tipo de ordenación que se desee.

source: Using FALSE as a key will evalute to integer 0 as key.
es: Se puede contar el número de elementos de un array usando la función count().

source: Using an emptry string as key will create (or overwrite) a key with an empty string and its value, it is not the same as using empty brackets.
es: Se puede recorrer un array usando las funciones next() y prev().

source: This is done by assigning values to the array while specifying the key in brackets.
es: Otra forma habitual de recorrer un array es usando la función each().

source: $arr[ key] = value; $arr[] = value; / / key is either string or nonnegative integer / / value can be anything
es: Los arrays multidimensionales son bastante simples actualmente.

source: If you only use "usual integer indices" (starting from zero, increasing by one), you can achive the reindex effect by using array_values().
es: Para cada dimensión del array, se puede añadir otro valor [clave] al final:

source: This works but also throws a PHP error of / / level E_NOTICE because of an undefined constant named fruit / / / / Notice:
es: $a[ 1] = $f; # ejemplos de una sola dimensión $a["foo"] = $f; $a[1][0] = $f; # bidimensional $a["foo"][2] = $f; # (se pueden mezclar índices numéricos y asociativos) $a[3]["bar"] = $f; # (se pueden mezclar índices numéricos y asociativos) $a["foo"][4]["bar"][0] = $f; # tetradimensional!

source: Use of undefined constant fruit - assumed 'fruit' in... print $arr[fruit]; / / apple / / Let's define a constant to demonstrate what's going on.
es: En PHP3 no es posible referirse a arrays multidimensionales directamente dentro de cadenas.

source: Constants are not / / looked for within strings so no E_NOTICE error here print "Hello $arr[fruit]"; / / Hello apple / / With one exception, braces surrounding arrays within strings / / allows constants to be looked for print "Hello {$arr[fruit]}"; / / Hello carrot print "Hello {$arr['fruit']}"; / / Hello apple / / This will not work, results in a parse error such as: / / Parse error: parse error, expecting T_STRING 'or T_VARIABLE' or T_NUM_STRING '/ / This of course applies to using autoglobals in strings as well print "Hello $arr['fruit']"; print "Hello $_GET['foo']"; / / Concatenation is another option print "Hello". $arr['fruit']; / / Hello apple?
es: Por ejemplo, lo siguiente no tendrá el resultado deseado:

source: By default, error_reporting is turned down to not show them.
es: $a[ 3]['bar'] = 'Bob'; echo "Esto no va a funcionar: $a[3][bar]";

source: That means that you can write things like this:
es: $a[ 3]['bar'] = 'Bob'; echo "Esto no va a funcionar: ". $a[3][bar];

source: ?php $error_descriptions[ 1] = "A fatal error has occured"; $error_descriptions[2] = "PHP issued a warning"; $error_descriptions[8] = "This is just an informal notice";?
es: En PHP4, sin embargo, todo el problema se puede circunvenir encerrando la referencia al array (dentro de la cadena) entre llaves:

source: PHP now assumes that you meant bar literally, as the string "bar", but that you forgot to write the quotes.
es: $a[ 3]['bar'] = 'Bob'; echo "Esto va a funcionar: {$a[3][bar]}";
